const pokemonDatabase = [
    {
        "name": "妙蛙花",
        "t1": "草",
        "t2": "毒",
        "image": "images/pokemon/妙蛙花.png"
    },
    {
        "name": "妙蛙花|超級妙蛙花",
        "t1": "草",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "噴火龍",
        "t1": "火",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "噴火龍|超級噴火龍Ｘ",
        "t1": "火",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "噴火龍|超級噴火龍Ｙ",
        "t1": "火",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "水箭龜",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "水箭龜|超級水箭龜",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "大針蜂",
        "t1": "蟲",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "大針蜂|超級大針蜂",
        "t1": "蟲",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "大比鳥",
        "t1": "一般",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "大比鳥|超級大比鳥",
        "t1": "一般",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "阿柏怪",
        "t1": "毒",
        "t2": "",
        "image": ""
    },
    {
        "name": "皮卡丘",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "雷丘",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "雷丘|阿羅拉的樣子",
        "t1": "電",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "皮可西",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "皮可西|超級皮可西",
        "t1": "妖精",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "九尾",
        "t1": "火",
        "t2": "",
        "image": ""
    },
    {
        "name": "九尾|阿羅拉的樣子",
        "t1": "冰",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "風速狗",
        "t1": "火",
        "t2": "",
        "image": ""
    },
    {
        "name": "風速狗|洗翠的樣子",
        "t1": "火",
        "t2": "岩石",
        "image": ""
    },
    {
        "name": "胡地",
        "t1": "超能力",
        "t2": "",
        "image": ""
    },
    {
        "name": "胡地|超級胡地",
        "t1": "超能力",
        "t2": "",
        "image": ""
    },
    {
        "name": "怪力",
        "t1": "格鬥",
        "t2": "",
        "image": ""
    },
    {
        "name": "大食花",
        "t1": "草",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "大食花|超級大食花",
        "t1": "草",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "呆殼獸",
        "t1": "水",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "呆殼獸|伽勒爾的樣子",
        "t1": "毒",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "呆殼獸|超級呆殼獸",
        "t1": "水",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "耿鬼",
        "t1": "幽靈",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "耿鬼|超級耿鬼",
        "t1": "幽靈",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "袋獸",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "袋獸|超級袋獸",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "寶石海星",
        "t1": "水",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "寶石海星|超級寶石海星",
        "t1": "水",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "凱羅斯",
        "t1": "蟲",
        "t2": "",
        "image": ""
    },
    {
        "name": "凱羅斯|超級凱羅斯",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "肯泰羅",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "肯泰羅",
        "t1": "格鬥",
        "t2": "水",
        "image": ""
    },
    {
        "name": "肯泰羅",
        "t1": "格鬥",
        "t2": "火",
        "image": ""
    },
    {
        "name": "肯泰羅",
        "t1": "格鬥",
        "t2": "",
        "image": ""
    },
    {
        "name": "暴鯉龍",
        "t1": "水",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "暴鯉龍|超級暴鯉龍",
        "t1": "水",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "百變怪",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "水伊布",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "雷伊布",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "火伊布",
        "t1": "火",
        "t2": "",
        "image": ""
    },
    {
        "name": "化石翼龍",
        "t1": "岩石",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "化石翼龍|超級化石翼龍",
        "t1": "岩石",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "卡比獸",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "快龍",
        "t1": "龍",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "快龍|超級快龍",
        "t1": "龍",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "大竺葵",
        "t1": "草",
        "t2": "",
        "image": ""
    },
    {
        "name": "大竺葵|超級大竺葵",
        "t1": "草",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "火爆獸",
        "t1": "火",
        "t2": "",
        "image": ""
    },
    {
        "name": "火爆獸|洗翠的樣子",
        "t1": "火",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "大力鱷",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "大力鱷|超級大力鱷",
        "t1": "水",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "阿利多斯",
        "t1": "蟲",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "電龍",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "電龍|超級電龍",
        "t1": "電",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "瑪力露麗",
        "t1": "水",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "蚊香蛙皇",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "太陽伊布",
        "t1": "超能力",
        "t2": "",
        "image": ""
    },
    {
        "name": "月亮伊布",
        "t1": "惡",
        "t2": "",
        "image": ""
    },
    {
        "name": "呆呆王",
        "t1": "水",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "呆呆王|伽勒爾的樣子",
        "t1": "毒",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "佛烈托斯",
        "t1": "蟲",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "大鋼蛇",
        "t1": "鋼",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "大鋼蛇|超級大鋼蛇",
        "t1": "鋼",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "巨鉗螳螂",
        "t1": "蟲",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "巨鉗螳螂|超級巨鉗螳螂",
        "t1": "蟲",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "赫拉克羅斯",
        "t1": "蟲",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "赫拉克羅斯|超級赫拉克羅斯",
        "t1": "蟲",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "盔甲鳥",
        "t1": "鋼",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "盔甲鳥|超級盔甲鳥",
        "t1": "鋼",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "黑魯加",
        "t1": "惡",
        "t2": "火",
        "image": ""
    },
    {
        "name": "黑魯加|超級黑魯加",
        "t1": "惡",
        "t2": "火",
        "image": ""
    },
    {
        "name": "班基拉斯",
        "t1": "岩石",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "班基拉斯|超級班基拉斯",
        "t1": "岩石",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "大嘴鷗",
        "t1": "水",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "沙奈朵",
        "t1": "超能力",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "沙奈朵|超級沙奈朵",
        "t1": "超能力",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "勾魂眼",
        "t1": "惡",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "勾魂眼|超級勾魂眼",
        "t1": "惡",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "波士可多拉",
        "t1": "鋼",
        "t2": "岩石",
        "image": ""
    },
    {
        "name": "波士可多拉|超級波士可多拉",
        "t1": "鋼",
        "t2": "",
        "image": ""
    },
    {
        "name": "恰雷姆",
        "t1": "格鬥",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "恰雷姆|超級恰雷姆",
        "t1": "格鬥",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "雷電獸",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "雷電獸|超級雷電獸",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "巨牙鯊",
        "t1": "水",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "巨牙鯊|超級巨牙鯊",
        "t1": "水",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "噴火駝",
        "t1": "火",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "噴火駝|超級噴火駝",
        "t1": "火",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "煤炭龜",
        "t1": "火",
        "t2": "",
        "image": ""
    },
    {
        "name": "七夕青鳥",
        "t1": "龍",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "七夕青鳥|超級七夕青鳥",
        "t1": "龍",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "美納斯",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "飄浮泡泡|飄浮泡泡的樣子",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "飄浮泡泡|雨水的樣子",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "飄浮泡泡|太陽的樣子",
        "t1": "火",
        "t2": "",
        "image": ""
    },
    {
        "name": "飄浮泡泡|雪雲的樣子",
        "t1": "冰",
        "t2": "",
        "image": ""
    },
    {
        "name": "詛咒娃娃",
        "t1": "幽靈",
        "t2": "",
        "image": ""
    },
    {
        "name": "詛咒娃娃|超級詛咒娃娃",
        "t1": "幽靈",
        "t2": "",
        "image": ""
    },
    {
        "name": "風鈴鈴",
        "t1": "超能力",
        "t2": "",
        "image": ""
    },
    {
        "name": "風鈴鈴|超級風鈴鈴",
        "t1": "超能力",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "阿勃梭魯",
        "t1": "惡",
        "t2": "",
        "image": ""
    },
    {
        "name": "阿勃梭魯|超級阿勃梭魯",
        "t1": "惡",
        "t2": "",
        "image": ""
    },
    {
        "name": "冰鬼護",
        "t1": "冰",
        "t2": "",
        "image": ""
    },
    {
        "name": "冰鬼護|超級冰鬼護",
        "t1": "冰",
        "t2": "",
        "image": ""
    },
    {
        "name": "土台龜",
        "t1": "草",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "烈焰猴",
        "t1": "火",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "帝王拿波",
        "t1": "水",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "倫琴貓",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "羅絲雷朵",
        "t1": "草",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "戰槌龍",
        "t1": "岩石",
        "t2": "",
        "image": ""
    },
    {
        "name": "護城龍",
        "t1": "岩石",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "長耳兔",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "長耳兔|超級長耳兔",
        "t1": "一般",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "花岩怪",
        "t1": "幽靈",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "烈咬陸鯊",
        "t1": "龍",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "烈咬陸鯊|超級烈咬陸鯊",
        "t1": "龍",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "路卡利歐",
        "t1": "格鬥",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "路卡利歐|超級路卡利歐",
        "t1": "格鬥",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "河馬獸",
        "t1": "地面",
        "t2": "",
        "image": ""
    },
    {
        "name": "毒骷蛙",
        "t1": "毒",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "暴雪王",
        "t1": "草",
        "t2": "冰",
        "image": ""
    },
    {
        "name": "暴雪王|超級暴雪王",
        "t1": "草",
        "t2": "冰",
        "image": ""
    },
    {
        "name": "瑪狃拉",
        "t1": "惡",
        "t2": "冰",
        "image": ""
    },
    {
        "name": "超甲狂犀",
        "t1": "地面",
        "t2": "岩石",
        "image": ""
    },
    {
        "name": "葉伊布",
        "t1": "草",
        "t2": "",
        "image": ""
    },
    {
        "name": "冰伊布",
        "t1": "冰",
        "t2": "",
        "image": ""
    },
    {
        "name": "天蠍王",
        "t1": "地面",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "象牙豬",
        "t1": "冰",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "艾路雷朵",
        "t1": "超能力",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "艾路雷朵|超級艾路雷朵",
        "t1": "超能力",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "雪妖女",
        "t1": "冰",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "雪妖女|超級雪妖女",
        "t1": "冰",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "洛托姆|洛托姆的樣子",
        "t1": "電",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "結霜洛托姆",
        "t1": "電",
        "t2": "冰",
        "image": ""
    },
    {
        "name": "旋轉洛托姆",
        "t1": "電",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "加熱洛托姆",
        "t1": "電",
        "t2": "火",
        "image": ""
    },
    {
        "name": "切割洛托姆",
        "t1": "電",
        "t2": "草",
        "image": ""
    },
    {
        "name": "清洗洛托姆",
        "t1": "電",
        "t2": "水",
        "image": ""
    },
    {
        "name": "君主蛇",
        "t1": "草",
        "t2": "",
        "image": ""
    },
    {
        "name": "炎武王",
        "t1": "火",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "炎武王|超級炎武王",
        "t1": "火",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "大劍鬼",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "大劍鬼|洗翠的樣子",
        "t1": "水",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "步哨鼠",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "酷豹",
        "t1": "惡",
        "t2": "",
        "image": ""
    },
    {
        "name": "花椰猿",
        "t1": "草",
        "t2": "",
        "image": ""
    },
    {
        "name": "爆香猿",
        "t1": "火",
        "t2": "",
        "image": ""
    },
    {
        "name": "冷水猿",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "龍頭地鼠",
        "t1": "地面",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "龍頭地鼠|超級龍頭地鼠",
        "t1": "地面",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "差不多娃娃",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "差不多娃娃|超級差不多娃娃",
        "t1": "一般",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "修建老匠",
        "t1": "格鬥",
        "t2": "",
        "image": ""
    },
    {
        "name": "風妖精",
        "t1": "草",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "流氓鱷",
        "t1": "地面",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "死神棺",
        "t1": "幽靈",
        "t2": "",
        "image": ""
    },
    {
        "name": "灰塵山",
        "t1": "毒",
        "t2": "",
        "image": ""
    },
    {
        "name": "索羅亞克",
        "t1": "惡",
        "t2": "",
        "image": ""
    },
    {
        "name": "索羅亞克|洗翠的樣子",
        "t1": "一般",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "人造細胞卵",
        "t1": "超能力",
        "t2": "",
        "image": ""
    },
    {
        "name": "雙倍多多冰",
        "t1": "冰",
        "t2": "",
        "image": ""
    },
    {
        "name": "電飛鼠",
        "t1": "電",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "水晶燈火靈",
        "t1": "幽靈",
        "t2": "火",
        "image": ""
    },
    {
        "name": "水晶燈火靈|超級水晶燈火靈",
        "t1": "幽靈",
        "t2": "火",
        "image": ""
    },
    {
        "name": "凍原熊",
        "t1": "冰",
        "t2": "",
        "image": ""
    },
    {
        "name": "泥巴魚",
        "t1": "地面",
        "t2": "電",
        "image": ""
    },
    {
        "name": "泥巴魚|伽勒爾的樣子",
        "t1": "地面",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "泥偶巨人",
        "t1": "地面",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "泥偶巨人|超級泥偶巨人",
        "t1": "地面",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "三首惡龍",
        "t1": "惡",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "火神蛾",
        "t1": "蟲",
        "t2": "火",
        "image": ""
    },
    {
        "name": "布里卡隆",
        "t1": "草",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "布里卡隆|超級布里卡隆",
        "t1": "草",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "妖火紅狐",
        "t1": "火",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "妖火紅狐|超級妖火紅狐",
        "t1": "火",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "甲賀忍蛙",
        "t1": "水",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "甲賀忍蛙|超級甲賀忍蛙",
        "t1": "水",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "掘地兔",
        "t1": "一般",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "烈箭鷹",
        "t1": "火",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "花園花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "群島花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "大陸花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "高雅花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "幻彩花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "庭園花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "荒野花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "冰雪花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "熱帶雨林花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "大海花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "摩登花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "驟雨花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "大洋花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "球球花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "雪國花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "大河花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "沙塵花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "熱帶草原花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "太陽花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "雪原花紋",
        "t1": "蟲",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "永恆之花",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "花葉蒂|超級花葉蒂",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "紅花",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "藍花",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "橙花",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "白花",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "黃花",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "流氓熊猫",
        "t1": "格鬥",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "多麗米亞|野生的樣子",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "紳士造型",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "淑女造型",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "菱形造型",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "心形造型",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "歌舞伎造型",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "女王造型",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "貴婦造型",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "國王造型",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "星形造型",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "超能妙喵|雄性的樣子",
        "t1": "超能力",
        "t2": "",
        "image": ""
    },
    {
        "name": "超能妙喵|雌性的樣子",
        "t1": "超能力",
        "t2": "",
        "image": ""
    },
    {
        "name": "超能妙喵|超級超能妙喵",
        "t1": "超能力",
        "t2": "",
        "image": ""
    },
    {
        "name": "盾牌形態",
        "t1": "鋼",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "刀劍形態",
        "t1": "鋼",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "芳香精",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "胖甜妮",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "鋼炮臂蝦",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "光電傘蜥",
        "t1": "電",
        "t2": "一般",
        "image": ""
    },
    {
        "name": "怪顎龍",
        "t1": "岩石",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "冰雪巨龍",
        "t1": "岩石",
        "t2": "冰",
        "image": ""
    },
    {
        "name": "仙子伊布",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "摔角鷹人",
        "t1": "格鬥",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "摔角鷹人|超級摔角鷹人",
        "t1": "格鬥",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "咚咚鼠",
        "t1": "電",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "黏美龍",
        "t1": "龍",
        "t2": "",
        "image": ""
    },
    {
        "name": "黏美龍|洗翠的樣子",
        "t1": "鋼",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "鑰圈兒",
        "t1": "鋼",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "朽木妖",
        "t1": "幽靈",
        "t2": "草",
        "image": ""
    },
    {
        "name": "南瓜怪人|中顆種",
        "t1": "幽靈",
        "t2": "草",
        "image": ""
    },
    {
        "name": "南瓜怪人|巨顆種",
        "t1": "幽靈",
        "t2": "草",
        "image": ""
    },
    {
        "name": "南瓜怪人|大顆種",
        "t1": "幽靈",
        "t2": "草",
        "image": ""
    },
    {
        "name": "南瓜怪人|小顆種",
        "t1": "幽靈",
        "t2": "草",
        "image": ""
    },
    {
        "name": "冰岩怪",
        "t1": "冰",
        "t2": "",
        "image": ""
    },
    {
        "name": "冰岩怪|洗翠的樣子",
        "t1": "冰",
        "t2": "岩石",
        "image": ""
    },
    {
        "name": "音波龍",
        "t1": "飛行",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "狙射樹梟",
        "t1": "草",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "狙射樹梟|洗翠的樣子",
        "t1": "草",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "熾焰咆哮虎",
        "t1": "火",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "西獅海壬",
        "t1": "水",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "銃嘴大鳥",
        "t1": "一般",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "好勝毛蟹",
        "t1": "格鬥",
        "t2": "冰",
        "image": ""
    },
    {
        "name": "好勝毛蟹|超級好勝毛蟹",
        "t1": "格鬥",
        "t2": "冰",
        "image": ""
    },
    {
        "name": "鬃岩狼人|白晝的樣子",
        "t1": "岩石",
        "t2": "",
        "image": ""
    },
    {
        "name": "鬃岩狼人|黑夜的樣子",
        "t1": "岩石",
        "t2": "",
        "image": ""
    },
    {
        "name": "鬃岩狼人|黃昏的樣子",
        "t1": "岩石",
        "t2": "",
        "image": ""
    },
    {
        "name": "超壞星",
        "t1": "毒",
        "t2": "水",
        "image": ""
    },
    {
        "name": "重泥挽馬",
        "t1": "地面",
        "t2": "",
        "image": ""
    },
    {
        "name": "滴蛛霸",
        "t1": "水",
        "t2": "蟲",
        "image": ""
    },
    {
        "name": "焰后蜥",
        "t1": "毒",
        "t2": "火",
        "image": ""
    },
    {
        "name": "甜冷美后",
        "t1": "草",
        "t2": "",
        "image": ""
    },
    {
        "name": "智揮猩",
        "t1": "一般",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "投擲猴",
        "t1": "格鬥",
        "t2": "",
        "image": ""
    },
    {
        "name": "謎拟Ｑ|化形的樣子",
        "t1": "幽靈",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "老翁龍",
        "t1": "一般",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "老翁龍|超級老翁龍",
        "t1": "一般",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "杖尾鱗甲龍",
        "t1": "龍",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "鋼鎧鴉",
        "t1": "飛行",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "蘋裹龍",
        "t1": "草",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "豐蜜龍",
        "t1": "草",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "沙螺蟒",
        "t1": "地面",
        "t2": "",
        "image": ""
    },
    {
        "name": "贗品形態",
        "t1": "幽靈",
        "t2": "",
        "image": ""
    },
    {
        "name": "真品形態",
        "t1": "幽靈",
        "t2": "",
        "image": ""
    },
    {
        "name": "布莉姆溫",
        "t1": "超能力",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "踏冰人偶",
        "t1": "冰",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "死神板",
        "t1": "地面",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "奶香香草",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "焦糖綜合",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "奶香檸檬",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "奶香抹茶",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "奶香薄荷",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "三色綜合",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "奶香紅鑽",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "紅鑽綜合",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "奶香雪鹽",
        "t1": "妖精",
        "t2": "",
        "image": ""
    },
    {
        "name": "滿腹花紋",
        "t1": "電",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "空腹花紋",
        "t1": "電",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "多龍巴魯托",
        "t1": "龍",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "詭角鹿",
        "t1": "一般",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "劈斧螳螂",
        "t1": "蟲",
        "t2": "岩石",
        "image": ""
    },
    {
        "name": "幽尾玄魚|雄性的樣子",
        "t1": "水",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "幽尾玄魚|雌性的樣子",
        "t1": "水",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "大狃拉",
        "t1": "格鬥",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "魔幻假面喵",
        "t1": "草",
        "t2": "惡",
        "image": ""
    },
    {
        "name": "骨紋巨聲鱷",
        "t1": "火",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "狂歡浪舞鴨",
        "t1": "水",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "巴布土撥",
        "t1": "電",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "四隻家庭",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "三隻家庭",
        "t1": "一般",
        "t2": "",
        "image": ""
    },
    {
        "name": "鹽石巨靈",
        "t1": "岩石",
        "t2": "",
        "image": ""
    },
    {
        "name": "紅蓮鎧騎",
        "t1": "火",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "蒼炎刃鬼",
        "t1": "火",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "電肚蛙",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "狠辣椒",
        "t1": "草",
        "t2": "火",
        "image": ""
    },
    {
        "name": "狠辣椒|超級狠辣椒",
        "t1": "草",
        "t2": "火",
        "image": ""
    },
    {
        "name": "超能豔鴕",
        "t1": "超能力",
        "t2": "",
        "image": ""
    },
    {
        "name": "巨鍛匠",
        "t1": "妖精",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "海豚俠|平凡形態",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "海豚俠|全能形態",
        "t1": "水",
        "t2": "",
        "image": ""
    },
    {
        "name": "拖拖蚓",
        "t1": "鋼",
        "t2": "",
        "image": ""
    },
    {
        "name": "晶光花",
        "t1": "岩石",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "晶光花|超級晶光花",
        "t1": "岩石",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "奇麒麟",
        "t1": "一般",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "仆斬将军",
        "t1": "惡",
        "t2": "鋼",
        "image": ""
    },
    {
        "name": "來悲粗茶|凡作的樣子",
        "t1": "草",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "來悲粗茶|傑作的樣子",
        "t1": "草",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "鋁鋼橋龍",
        "t1": "鋼",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "蜜集大蛇",
        "t1": "草",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "雷丘|超級雷丘Ｘ",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "雷丘|超級雷丘Ｙ",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "霸王花",
        "t1": "草",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "千針魚",
        "t1": "水",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "蜥蜴王",
        "t1": "草",
        "t2": "",
        "image": ""
    },
    {
        "name": "蜥蜴王|超級蜥蜴王",
        "t1": "草",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "火焰鸡",
        "t1": "火",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "火焰鸡|超級火焰鸡",
        "t1": "火",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "巨沼怪",
        "t1": "水",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "巨沼怪|超級巨沼怪",
        "t1": "水",
        "t2": "地面",
        "image": ""
    },
    {
        "name": "大嘴娃",
        "t1": "鋼",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "大嘴娃|超級大嘴娃",
        "t1": "鋼",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "巨金怪",
        "t1": "鋼",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "巨金怪|超級巨金怪",
        "t1": "鋼",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "姆克鹰",
        "t1": "一般",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "姆克鹰|超級姆克鹰",
        "t1": "格鬥",
        "t2": "飛行",
        "image": ""
    },
    {
        "name": "梦梦蚀",
        "t1": "超能力",
        "t2": "",
        "image": ""
    },
    {
        "name": "蜈蚣王",
        "t1": "蟲",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "蜈蚣王|超級蜈蚣王",
        "t1": "蟲",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "頭巾混混",
        "t1": "惡",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "頭巾混混|超級頭巾混混",
        "t1": "惡",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "麻麻鳗魚王",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "麻麻鳗魚王|超級麻麻鳗魚王",
        "t1": "電",
        "t2": "",
        "image": ""
    },
    {
        "name": "火炎狮|雄性的樣子）",
        "t1": "火",
        "t2": "一般",
        "image": ""
    },
    {
        "name": "火炎狮|雌性的樣子）",
        "t1": "火",
        "t2": "一般",
        "image": ""
    },
    {
        "name": "火炎狮|超級火炎狮",
        "t1": "火",
        "t2": "一般",
        "image": ""
    },
    {
        "name": "乌賊王",
        "t1": "惡",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "乌賊王|超級乌賊王",
        "t1": "惡",
        "t2": "超能力",
        "image": ""
    },
    {
        "name": "龜足巨铠",
        "t1": "岩石",
        "t2": "水",
        "image": ""
    },
    {
        "name": "龜足巨铠|超級龜足巨铠",
        "t1": "岩石",
        "t2": "格鬥",
        "image": ""
    },
    {
        "name": "毒藻龍",
        "t1": "毒",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "毒藻龍|超級毒藻龍",
        "t1": "毒",
        "t2": "龍",
        "image": ""
    },
    {
        "name": "長毛巨魔",
        "t1": "惡",
        "t2": "妖精",
        "image": ""
    },
    {
        "name": "列陣兵",
        "t1": "格鬥",
        "t2": "",
        "image": ""
    },
    {
        "name": "列陣兵|超級列陣兵",
        "t1": "格鬥",
        "t2": "",
        "image": ""
    },
    {
        "name": "萬針魚",
        "t1": "惡",
        "t2": "毒",
        "image": ""
    },
    {
        "name": "墓揚犬",
        "t1": "幽靈",
        "t2": "",
        "image": ""
    },
    {
        "name": "棄世猴",
        "t1": "格鬥",
        "t2": "幽靈",
        "image": ""
    },
    {
        "name": "賽富豪",
        "t1": "鋼",
        "t2": "幽靈",
        "image": ""
    }
];
